test/addedMassCalculator/box/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floatingObject
    {
//        type            movingWallVelocity;
        type            fixedValue;
        value           uniform (0 0 0);
    }


    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    rim
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
//        type            slip;
    }
}


// ************************************************************************* //
